# macOS package set — installed via `brew bundle` from the chezmoi package hook.
# (Not applied to $HOME; see .chezmoiignore.)

# Terminal + multiplexer
cask "ghostty"
cask "font-fira-code-nerd-font"
brew "tmux"

# Shell experience
brew "zoxide"        # smarter cd (z)
brew "autojump"      # classic dir jump (j) — muscle memory
brew "bitwarden-cli" # bw — secret retrieval for chezmoi
brew "fzf"           # fuzzy finder
brew "atuin"         # shell history
brew "direnv"        # per-dir env
brew "eza"           # modern ls
brew "bat"           # modern cat
brew "fd"            # modern find
brew "ripgrep"       # rg

# Editor
brew "neovim"
brew "node"          # required by Mason to install pyright (+ general JS/TS dev)

# Code review / git (the CLI-review stack)
brew "git"
brew "git-delta"     # diff pager
brew "difftastic"    # structural diffs
brew "lazygit"       # hunk-staging TUI
brew "tig"           # commit/history browser
brew "gh"            # GitHub PRs
brew "hunk"          # review-first TUI for agent changesets

# Dotfiles engine
brew "chezmoi"
